buzzwang1/pcb/source/Driver/STM32/U5/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
#ifndef __cUSART_MPHD_H__
#define __cUSART_MPHD_H__

#include "Typedef.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_ll_usart.h"
#include "stm32u5xx_ll_lpuart.h"
#include "stm32u5xx_ll_dma.h"

#include "cUartMpHdTimer.h"

#include "tGPPin.h"
#include "ComDat.h"

#include "ClockInfo.h"


class cComNodeListUsartMpHd_Master :public cComNodeList
{
  public:
    cComNodeListUsartMpHd_Master(uint32 lui32SlavesCnt)
      :cComNodeList(lui32SlavesCnt)
    {}

  inline uint32 SizeOf()
  {
    return cComNodeList::SizeOf() +
           sizeof(cComNodeListUsartMpHd_Master);
  }
};


class cUartMpHd
{
  public:
  cComNode::tenState   mSm;
  tenComDeviceStatus   munDeviceStatus;
  tenComBusStatus      munBusStatus;
  tenComStatus         munComStatus;

  u16                  mu16TickCounter;
  u16                  mu16DmaCounter2ms_Old;

  u32                  mu32Baudrate;

  //Single Wire, only Tx Pin
  cGpPin        *mPinTx;
  USART_TypeDef *mUsart;

  u8    mu8DmaCh;
  DMA_Channel_TypeDef* mstDmaCh;
  u32   mu32DmaRxTr1;
  u32   mu32DmaRxTr2;
  u32   mu32DmaRxPeriph;
  u32   mu32DmaTxTr1;
  u32   mu32DmaTxTr2;
  u32   mu32DmaTxPeriph;

  uint8 mui8Adr;
  bool  mbMaster;
  cComNode::tenConsts menOption;

  cUartMpHd(USART_TypeDef *lstUsart, u32 lu32Baudrate, cGpPin* lcRxTx, u8 lu8DmaCh, bool  lbMaster)
  {
    mUsart = lstUsart;

    mu32Baudrate = lu32Baudrate;

    mPinTx   = lcRxTx;

    mu8DmaCh = lu8DmaCh;
    mstDmaCh = ((DMA_Channel_TypeDef*)(GPDMA1_BASE + LL_DMA_CH_OFFSET_TAB[mu8DmaCh]));

    munDeviceStatus = tenComDeviceStatus::enDeviceNotInit;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;

    mbMaster        = lbMaster;
    menOption       = cComNode::tenConsts::enNop;
  }

  void  vStopDMA()
  {
    LL_USART_DisableDMAReq_RX(mUsart);
    LL_USART_DisableDMAReq_TX(mUsart);
    mstDmaCh->CCR &= ~DMA_CCR_EN;
  }

  // Überpruft ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounter()
  {
    return (mstDmaCh->CBR1 & 0xFFFF);
  }

  void  vStartDMARx(uint8* pBuffer, uint32 BufferSize)
  {
      mu16DmaCounter2ms_Old = BufferSize;
      mstDmaCh->CFCR = DMA_CFCR_TCF;
      mstDmaCh->CCR &= ~DMA_CCR_EN;
      mstDmaCh->CBR1 = BufferSize;
      mstDmaCh->CSAR = mu32DmaRxPeriph;
      mstDmaCh->CDAR = (uint32)pBuffer;
      mstDmaCh->CTR1 = mu32DmaRxTr1;
      mstDmaCh->CTR2 = mu32DmaRxTr2;
      mstDmaCh->CCR |= DMA_CCR_EN;
      LL_USART_EnableDMAReq_RX(mUsart);

  }

  void  vStartDMATx(uint8* pBuffer, uint32 BufferSize)
  {
      mstDmaCh->CFCR = DMA_CFCR_TCF;
      mstDmaCh->CCR &= ~DMA_CCR_EN;
      mstDmaCh->CBR1 = BufferSize;
      mstDmaCh->CSAR = (uint32)pBuffer;
      mstDmaCh->CDAR = mu32DmaTxPeriph;
      mstDmaCh->CTR1 = mu32DmaTxTr1;
      mstDmaCh->CTR2 = mu32DmaTxTr2;
      mstDmaCh->CCR |= DMA_CCR_EN;
      LL_USART_EnableDMAReq_TX(mUsart);
  }

  void  vInitHw()
  {
    /* Disable USART clock */
    if (mUsart == USART1)      { __HAL_RCC_USART1_FORCE_RESET(); __HAL_RCC_USART1_RELEASE_RESET();}
    else if (mUsart == USART2) { __HAL_RCC_USART2_FORCE_RESET(); __HAL_RCC_USART2_RELEASE_RESET(); }
    else if (mUsart == USART3) { __HAL_RCC_USART3_FORCE_RESET(); __HAL_RCC_USART3_RELEASE_RESET(); }

    // Enable DMA
    __HAL_RCC_GPDMA1_CLK_ENABLE();

    vStopDMA();

    //SDA and SCL must be pulled high
    if (mbMaster)
    {
      if (!bCheckPins()) return;
    }

    //Single wire, only TX line
    if (mUsart == USART1)      { mPinTx->vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART1);}
    else if (mUsart == USART2) { mPinTx->vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART2);}
    else if (mUsart == USART3) { mPinTx->vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART3);}

    // Usart Periph clock enable
    if (mUsart == USART1) __HAL_RCC_USART1_CLK_ENABLE();
    else if (mUsart == USART2) __HAL_RCC_USART2_CLK_ENABLE();
    else if (mUsart == USART3) __HAL_RCC_USART3_CLK_ENABLE();

    // Usart Peripheral Disable
    LL_USART_Disable(mUsart);

    LL_USART_InitTypeDef lstInit;
    LL_USART_StructInit(&lstInit);

    lstInit.BaudRate            = mu32Baudrate;
    lstInit.DataWidth           = LL_USART_DATAWIDTH_9B;
    lstInit.StopBits            = LL_USART_STOPBITS_1;
    lstInit.Parity              = LL_USART_PARITY_NONE;
    lstInit.TransferDirection   = LL_USART_DIRECTION_TX_RX;
    lstInit.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    lstInit.OverSampling        = LL_USART_OVERSAMPLING_8;

    LL_USART_Init(mUsart, &lstInit);

    LL_USART_EnableHalfDuplex(mUsart);
    LL_USART_ConfigNodeAddress(mUsart, LL_USART_ADDRESS_DETECT_4B, mui8Adr);

    if (!mbMaster)
    {
      LL_USART_EnableMuteMode(mUsart);
      LL_USART_SetWakeUpMethod(mUsart, LL_USART_WAKEUP_ADDRESSMARK);
    }

    // Usart Peripheral Enable
    LL_USART_Enable(mUsart);
    mUsart->ICR = 0xFFFFFFFF;

    //if (!mbMaster)
    //{
    //  LL_USART_RequestEnterMuteMode(mUsart);
    //}

    if (isErrorActive())
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
      return;
    }

    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      return;
    }

    // USART TC interrupt
    IRQn_Type lnNVIC_IRQChannel;
    if (mUsart == USART1) lnNVIC_IRQChannel = USART1_IRQn;
    else if (mUsart == USART2) lnNVIC_IRQChannel = USART2_IRQn;
    else /*if (mUsart == USART3)*/ lnNVIC_IRQChannel = USART3_IRQn;

    // Set the priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 6, 8); // Höhere Prio,wegen Asynchron
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    mUsart->CR1 |= LL_USART_CR1_TCIE;
    mUsart->CR3 |= LL_USART_CR3_EIE;

    // ----------- DMA ---------
    LL_DMA_InitTypeDef           lstDmaInit;

    LL_DMA_StructInit(&lstDmaInit);

    lstDmaInit.BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    lstDmaInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;

    lstDmaInit.SrcBurstLength = 1;
    lstDmaInit.DestBurstLength = 1;

