buzzwang1/pcb/source/Driver/STM32/U5/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
    lstDmaInit.Priority = LL_DMA_LOW_PRIORITY_LOW_WEIGHT;
    lstDmaInit.BlkDataLength = 0;

    lstDmaInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;

    // -Port 0 should be allocated for transfers toand from
    //  peripherals, because there is a direct hardware datapath
    //  between this portand the APB peripherals, outside the  AHB matrix
    // -Port 1 should be allocated for transfers toand from
    //  memory, which are performed through the AHB interconnect.

    if (mUsart == USART1) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART1_RX;
    if (mUsart == USART2) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART2_RX;
    if (mUsart == USART3) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART3_RX;
    //if (mUsart == USART4) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART4_RX;
    lstDmaInit.SrcAddress  = LL_USART_DMA_GetRegAddr(mUsart, LL_USART_DMA_REG_DATA_RECEIVE);
    lstDmaInit.DestAddress = 0;
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_FIXED;
    lstDmaInit.DestIncMode = LL_DMA_DEST_INCREMENT;
    lstDmaInit.SrcDataWidth = LL_DMA_DEST_DATAWIDTH_HALFWORD; // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lstDmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;  
    lstDmaInit.Direction   = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT0; // Source is periph
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT1; // Dest is memory
    LL_DMA_Init(GPDMA1, mu8DmaCh, &lstDmaInit);

    mu32DmaRxTr1    = mstDmaCh->CTR1;
    mu32DmaRxTr2    = mstDmaCh->CTR2;
    mu32DmaRxPeriph = mstDmaCh->CSAR;

    if (mUsart == USART1) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART1_TX;
    if (mUsart == USART2) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART2_TX;
    if (mUsart == USART3) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART3_TX;
    //if (mUsart == USART4) lstDmaInit.Request = LL_GPDMA1_REQUEST_USART4_TX;
    lstDmaInit.SrcAddress  = 0;
    lstDmaInit.DestAddress = LL_USART_DMA_GetRegAddr(mUsart, LL_USART_DMA_REG_DATA_TRANSMIT);
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_INCREMENT;
    lstDmaInit.DestIncMode = LL_DMA_DEST_FIXED;
    lstDmaInit.SrcDataWidth  = LL_DMA_DEST_DATAWIDTH_BYTE;
    lstDmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_HALFWORD;  // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lstDmaInit.Direction   = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT1; // Source is memory
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT0; // Dest is periph
    LL_DMA_Init(GPDMA1, mu8DmaCh, &lstDmaInit);

    mu32DmaTxTr1    = mstDmaCh->CTR1;
    mu32DmaTxTr2    = mstDmaCh->CTR2;
    mu32DmaTxPeriph = mstDmaCh->CDAR;

    munDeviceStatus = tenComDeviceStatus::enDeviceReady;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;
    mSm             = cComNode::tenState::enStIdle;
  }

  void  vReInitHw(cComNode::tenConsts lenOption)
  {
    menOption = lenOption;
  }

  void vTick10ms()
  {
    cComNode::tenConsts lenOption;
    lenOption = menOption;
    if (lenOption != cComNode::tenConsts::enNop)
    {
      if (lenOption == cComNode::enResetHwFull)
      {
        vInitHw();
      }
      else  // enResetHwDma
      {
        // Usart Peripheral Disnable

        // Wenn man Uart deaktiviert, wird (aus welchen Grund auch immer) TC dauerhaft im Uart Status gesetzt
        // => Endlos Interrupt Request
        // Vom daher nicht machen
        // 
        //LL_USART_Disable(mUsart);
        vStopDMA();

        if (mbMaster)
        {
          //TX must be pulled high
          if (!bCheckPins()) return;

          mPinTx->vSetMode(GPIO_MODE_AF_OD);
        }

        mUsart->ICR = 0xFFFFFFFF;

        // Usart Peripheral Enable
        // LL_USART_Enable(mUsart);

        munDeviceStatus = tenComDeviceStatus::enDeviceReady;
        munBusStatus    = tenComBusStatus::enBusNoError;
        munComStatus    = tenComStatus::enStatusIdle;
        mSm             = cComNode::tenState::enStIdle;
      }

      if (isErrorActive())
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
        return;
      }

      if (mUsart->ISR & USART_ISR_BUSY)
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enBusNotReady;
        return;
      }

      if (munDeviceStatus == tenComDeviceStatus::enDeviceReady)
      {
        menOption = cComNode::tenConsts::enNop;
      }
    }
  }

  bool  bCheckBus()
  {
    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      mSm = cComNode::enStError;
      return False;
    }
    return True;
  }

  bool  bCheckPins()
  {
    mPinTx->vSetMode(GPIO_MODE_INPUT);
    //mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //Tx must be pulled high
    if (mPinTx->ui8Get() == 0)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorPins;
      mSm             = cComNode::enStError;
      return False;
    }
    return True;
  }
  uint8 isErrorActive()
  {
    return 0;
  }
};



class cUartMpHdMaster : public cUartMpHd
{
  public:

  uint16             mu16ReInitTicks;
  uint16             mu16ReInitTicksReload;
  uint16             mu16ComStuckTicks;
  uint16             mu16ComStuckTicksReload;


  cComNodeListUsartMpHd_Master  mcSlaves;
  cComNode                      *mpcActiveSlave;
  cComDatMsg                    *mpcActiveMsg;

  cComNode::tenState   menComState;
  uint8               *mpui8ComBuf;
  uint32               mui32ComByteCnt;

  u8                   mu8Lock;
  u8                   mu8SelfTimer;
  bool                 isNoErrorHandling;

  cBotNet_DownLinkUsartMpHd_Timer mTimer;

  cUartMpHdMaster(USART_TypeDef *lstUsart, uint32 lui32Slaves, u32 lu32Baudrate, cGpPin* lcTxRx, u8 lu8DmaCh)
    : cUartMpHd(lstUsart, lu32Baudrate, lcTxRx, lu8DmaCh, True), mcSlaves(lui32Slaves)
  {
    vInit();
  }

  void vInit()
  {
    mSm = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;

    mpcActiveSlave = NULL;
    mpcActiveMsg = NULL;

