buzzwang1/pcb/source/Driver/STM32/U5/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
    if (mSm_Old != mSm)
    {
      mu16ComStuckTicks = mu16ComStuckTicksReload;
    }
  }

  void vStartMsg(cComDatMsg *lpcActiveMsg) // __attribute__((optimize("-O0")))
  {
    if (mSm == cComNode::tenState::enStIdle)
    {
      bool lbStart;

      lbStart = true;

      if (mpcActiveMsg != NULL)
      {
        if (mpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lpcActiveMsg != NULL)
      {
        if (lpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lbStart)
      {
        lbStart = bCheckBus();
      }

      if (lbStart)
      {
        mpcActiveMsg = lpcActiveMsg;
        mpcActiveMsg->vBusy();
        vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvStart);
      }
    }
  }

  bool bStartNext() // __attribute__((optimize("-O0")))
  {
    if ((mSm == cComNode::tenState::enStIdle) && (!mu8Lock))
    {
      bool lbStart;

      lbStart = true;

      if (mpcActiveMsg != NULL)
      {
        if (mpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lbStart)
      {
        lbStart &= (!mcSlaves.isEmpty());
      }

      if (lbStart)
      {
        mpcActiveSlave = (cComNode*)mcSlaves.cGetNext();
        mpcActiveSlave->mStatus.IsStartRequested = 0;
        mpcActiveSlave->vComStart(cComNode::tenEvent::enEvPrepareToSendData);
      }
    }
    return True;
  }
};



class cUartMpHdSlave : public cUartMpHd
{
  public:
  cComDatMsg          *mpcMsg;

  cComNode            *mpcComNode;
  cComNode::tenState   menComState;
  cComNode::tenError   menErrorActive;

  cUsartMpHd_Slave_Timer mTimer;

  u8                   mu8SelfTimer;
  bool                 isNoErrorHandling;

  cUartMpHdSlave(USART_TypeDef *lstUsart, u32 lu32Baudrate, cGpPin* lcTxRx, u8 lu8DmaCh)
  : cUartMpHd(lstUsart, lu32Baudrate, lcTxRx, lu8DmaCh, False)
  {
    mSm         = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;
    mpcComNode  = NULL;
    mpcMsg      = NULL;
    mu8SelfTimer = 0;
    isNoErrorHandling = False;
  }

  ~cUartMpHdSlave()
  {
  }

  void vTick1ms()
  {
  }

  void vSetNode(cComNode *lpcComNode)
  {
    mpcComNode = lpcComNode;
    if (mpcComNode != null)
    {
      mui8Adr = mpcComNode->mAdr;
      vInitHw();
    }
  }

  void vSupressErrorHandling()
  {
    isNoErrorHandling = True;
  }

  void vResetCom()
  {
    // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
    LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
    LL_USART_RequestRxDataFlush(mUsart);
    vStopDMA();

    mTimer.vStop();
    mUsart->ICR = 0xFFFF;

    vReInitHw(cComNode::tenConsts::enResetHwFull);
    vTick10ms();

    mSm = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;
  }

  void vError(cComNode::tenError lenError)
  {
    if (mpcMsg != NULL)
    {
      if (mpcMsg->isBusy())
      {
        mpcMsg->vError();
      }
    }

    mSm = cComNode::tenState::enStIdle;

    if (mpcComNode != NULL)
    {
      mpcComNode->vComError(lenError, menComState);
    }

    if (isNoErrorHandling)
    {
      isNoErrorHandling = False;
    }
    else
    {
      vResetCom();
    }
  }

  void TIM_EV_IRQHandler()
  {
    if (mpcComNode)
    {
      if (mu8SelfTimer)
      {
        u16 lu16DmaCounter = u16GetDmaCounter();
        if (mu16DmaCounter2ms_Old == lu16DmaCounter) // Counter hat sich nicht geändert
        {
          mu8SelfTimer = 0;
          vError(cComNode::enErTimeout);
        }
        else  // Timer neu starten
        {
          mu8SelfTimer = 1;
          mu16DmaCounter2ms_Old = lu16DmaCounter;
          mTimer.vStart(250);
        }
      }
      else
      {
        mpcComNode->vComStart(cComNode::tenEvent::enEvMisc);
      }
    }
  }

  void ComIrqHandler(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)
  {
    if (lenEventType == cComNode::tenEventType::enEvTyError)
    {
      if (lenEvent == cComNode::tenEvent::enEvUsartErOre)
      {
        // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
        vError(cComNode::enErOverrun);
      }
      else
      {
        vError(cComNode::enErUnknown);
      }
    }
    else
    {
      vSm(lenEventType, lenEvent);
    }
  }


  void vSetMsg(cComDatMsg* lpcMsg)
  {
    mpcMsg = lpcMsg;
  };

  inline void vMute()
  {
    LL_USART_RequestEnterMuteMode(mUsart);
  }

  inline void vDone()
  {
    mTimer.vStop();
    mu8SelfTimer = 0;
    // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
    LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
    vStopDMA();
    mSm = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;
    mpcMsg->vDone();
    mpcComNode->vComDone();
  }


  void vWaitMsg(cComDatMsg* lpcMsg)
  {
    if (!(LL_USART_IsActiveFlag_RWU(mUsart)))    // Nicht im Mute modus
    {
      vSetMsg(lpcMsg);
      vMute();
      LL_USART_RequestRxDataFlush(mUsart);
      LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX_RX); // Alles einschalten
      vStartDMARx(mpcMsg->cRxData.mpu8Data, mpcMsg->cRxData.muiLen);
      mUsart->ICR = USART_ICR_CMCF;
      mSm = cComNode::tenState::enStWaitAdress;
    }
  }

  void vStartMsg(cComDatMsg* lpcMsg)
  {
    if (!(LL_USART_IsActiveFlag_RWU(mUsart)))    // Nicht im Mute modus
    {
      vSetMsg(lpcMsg);
      // Rx
      if (mpcMsg->cRxData.muiLen > 0)
      {
        menComState = cComNode::tenState::enStWaitData;
        LL_USART_RequestRxDataFlush(mUsart);
        LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX_RX); // Alles einschalten
        vStartDMARx(mpcMsg->cRxData.mpu8Data, mpcMsg->cRxData.muiLen);
        mu8SelfTimer = 1;
        mTimer.vStart(250);
        mSm = cComNode::tenState::enStWait;
      }
      else
      {
        // Tx
        if (mpcMsg->cTxData.muiLen > 0)
        {
          menComState = cComNode::tenState::enStData;
          LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
          vStartDMATx(mpcMsg->cTxData.mpu8Data, mpcMsg->cTxData.muiLen);
          mSm = cComNode::tenState::enStEnd;
        }
        else
        {
          vDone();
        }
      }
    }
  }


  void vSm(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent) // __attribute__((optimize("-O0")))
  {
    UNUSED(lenEventType);
    uint32 lui32ISR;

    lui32ISR = mUsart->ISR;

